OpenFOAM-6-cantera-openmpi/tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet       { $:inlet.p; }
    outlet      { $:outlet.p; }
    staticWalls { $:wall.p; }
    movingWalls { $staticWalls; }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
