OpenFOAM-6-cantera-openmpi/tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
(
    "AMI.obj"
    "shaft.obj"
    "wall.obj"
    "statorBlades.obj"
    "rotorBlades.obj"
);

// Identify a feature when angle between faces < includedAngle
includedAngle   150;

trimFeatures
{
    minElem         10;   // minimum edges within a feature
}

writeObj        yes;  // writes out _edgeMesh.obj files to view features

// ************************************************************************* //
